HELP = """
Задати питання та знайти інформацію можна тут
"""

START = """
Привіт! Я бот електронної черги на ФІОТ. 
Через мене можна зареєструватись у чергу на подання документів 😊
"""

LAST_NAME = """
Будь ласка, введіть своє прізвище (наприклад: Фітільов)
"""

FIRST_NAME = """
Введіть своє ім'я (наприклад: Микола)
"""

SURNAME = """
Введіть своє по батькові (наприклад: Григорович) або відправте "-", якщо у вас його немає
"""

GENDER = """
Будь ласка, вкажіть вашу стать

Ваші особисті дані будуть використані лише для формування заявки на вступ.
"""

EMAIL = """
Вкажіть вашу електронну пошту (наприклад: john@gmail.com)

Ваші особисті дані будуть використані лише для формування заявки на вступ.
"""

PHONE = """
Вкажіть ваш номер телефону (наприклад: +380961234567)

Ваші особисті дані будуть використані лише для формування заявки на вступ.
"""

MENU = """
<b>Електронна черга ФІОТ</b>

Для реєстрації у черзі на подання документів, натисніть \"Усі черги\" та оберіть необхідну вам.

Якщо у вас виникнуть якісь запитання чи проблеми, натисніть кнопку \"Допомога\" та напишіть нам про це.

Якщо ви хочете прискорити подання документів, натисніть кнопку <b>Продовжити реєстрацію</b>.
"""